000100221005         DCL-F RESTATEDS2  Workstn;
000101221005         EXSR CLEAR;
000102221005         EXFMT SaleInfo;
000103221005         DOW NOT(*IN03);
000104221005            SELECT;
000105221005              WHEN HOUSEPRICE = 0;
000106221005               *IN81 = *ON;
000107221005              EXFMT SALEINFO;
000108221005               *IN81 = *OFF;
000109221005              ITER;
000110221005              WHEN PRESIDENCE = '';
000111221005               *IN82 = *ON;
000112221005              EXFMT SALEINFO;
000113221005               *IN82 = *OFF;
000114221005              ITER;
000115221005             WHEN FIRSTTIME = '';
000116221005              *IN83 = *ON;
000117221005             EXFMT SALEINFO;
000118221005              *IN83 = *OFF;
000119221005             ITER;
000120221005             WHEN *IN06;
000121221005              LEGALFEES = 900;
000122221005              SURVEYFEE = 850;
000123221005              TITLEINS = 265;
000124221005              INSPECTION = 425;
000125221005             EXFMT SALEINFO;
000126221005             ITER;
000127221005
000128221005            OTHER;
000129221005             EXSR BUYERSR;
000130221005             EXSR SELLERSR;
000131221005             *IN79 = *ON;
000132221005             *IN99 = *ON;
000133221005             WRITE SaleInfo;
000134221005             IF TOTALCOSTS < 1000;
000135221005            *IN85 = *ON;
000136221005             ENDIF;
000137221005             EXFMT Result;
000138221005             *IN79 = *OFF;
000139221005            ENDSL;
000140221005           IF *IN03 = *OFF;
000141221005             EXSR CLEAR;
000142221005             EXFMT SaleInfo;
000143221005           ENDIF;
000144221005         ENDDO;
000145221005
000146221005       *INLR = *ON;
000147221005            RETURN;
000148221005       BEGSR CLEAR;
000149221005         LegalFees = 0;
000150221005         SurveyFee = 0;
000151221005         TitleIns = 0;
000152221005         Inspection = 0;
000153221005         HousePrice = 0;
000154221005         PResidence = ' ';
000155221005         FirstTime = ' ';
000156221005         AgentRate = 5;
000157221005         totalcosts = 0;
000158221005       ENDSR;
000159221005       BEGSR BuyerSr;
000160221005         TotalCosts = LegalFees + SurveyFee + TitleIns + Inspection;
000161221005         If TotalCosts < 1001;
000162221005          *IN85 = *ON;
000163221005           *IN99 = *ON;
000164221005           ELSE;
000165221005             *IN99 = *OFF;
000166221005         ENDIF;
000167221005         SELECT;
000168221005           When FirstTime = 'Y';
000169221005             LandTax = 0;
000170221005           When HousePrice > 2000000;
000171221005             EVAL(H) LandTax = HousePrice * .025;
000172221005           When HousePrice > 399999;
000173221005             EVAL(H) LandTax = HousePrice * .02;
000174221005           When HousePrice > 249999;
000175221005             EVAL(H) LandTax = HousePrice * .015;
000176221005           When HousePrice > 54999;
000177221005             EVAL(H) LandTax = HousePrice * .01;
000178221005           Other;
000179221005             EVAL(H) LandTax = HousePrice * .005;
000180221005         ENDSL;
000181221005         BuyerPays = HousePrice + LandTax + TotalCosts;
000182221005       ENDSR;
000183221005
000184221005       BEGSR SellerSR;
000185221005         Commission = AgentRate/100 * HousePrice;
000186221005         If PResidence = 'Y';
000187221005           SellerNets = HousePrice - Commission;
000188221005         Else;
000189221005           EVAL(H) CapitalGns = (HousePrice * .5) * .07;
000190221005           SellerNets = HousePrice - (Commission + CapitalGns);
000191221005         ENDIF;
000192221005       ENDSR;
000193221005
