000100221010             ADDLIBLE   BCI433LIB
000101221010             MONMSG     MSGID(CPF2103)
000102221010             CALL       STRJOB
000103221010             DSPSYSLVL  *DISPLAY
000104221010
