000100221205       Dcl-Proc INDICATORS Export;
000101221205         Dcl-pi *N Zoned(7:2);
000102221205           Zone Char(1);
000103221205
000127221205         END-PI;
000128221205             SELECT;
000129221205              WHEN HOUSEPRICE = 0;
000130221205               *IN81 = *ON;
000131221205              EXFMT SALEINFO;
000132221205               *IN81 = *OFF;
000133221205              ITER;
000134221205              WHEN PRESIDENCE = '';
000135221205               *IN82 = *ON;
000136221205              EXFMT SALEINFO;
000137221205               *IN82 = *OFF;
000138221205              ITER;
000139221205             WHEN FIRSTTIME = '';
000140221205              *IN83 = *ON;
000141221205             EXFMT SALEINFO;
000142221205              *IN83 = *OFF;
000143221205             ITER;
000144221205             WHEN *IN06;
000145221205              LEGALFEES = 900;
000146221205              SURVEYFEE = 850;
000147221205              TITLEINS = 265;
000148221205              INSPECTION = 425;
000149221205             EXFMT SALEINFO;
000150221205             ITER;
000151221205            ENDSL;
000152221205
000153221205
000154221205
000155221205       END-PROC;
